// Задача 2: Напишите программу, которая на вход принимает 
// два числа и выдаёт, какое число большее, а какое меньшее.

int a = 10;
int b = 2;
if (a > b)
{
    Console.WriteLine("Максимальное число: " + a);
}
else
{
    Console.WriteLine("Максимальное число: " + b);
}
