// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int a = 7;
if (a % 2 == 0)
{
    Console.WriteLine("Число: " + a + " является чётным");
}
else
{
    Console.WriteLine("Число: " + a + " не является чётным");
}